[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [asd-as-sub-with-ED / null for each-77561 (test-comment)](http://dev.dev.env0.com/p/af1f8624-5f4c-41f9-bb9f-4d0c1f3280ea/environments/bc6dbd3d-3580-451f-a22c-1e3f2f206f47):
```
Plan: 5 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.example["file1.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 1"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file1.txt"
+       id                   = (known after apply)
    }


  # local_file.example["file2.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 2"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file2.txt"
+       id                   = (known after apply)
    }

  # local_file.example["file3.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 3"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file3.txt"
+       id                   = (known after apply)
    }

  # null_resource.null1 will be created
+   resource "null_resource" "null1" {
+       id = (known after apply)
    }

  # null_resource.null3 will be created
+   resource "null_resource" "null3" {
+       id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```
</details>


```
Failed to calculate cost estimation
```

To *apply* this plan, use the following comment:
```
env0 apply -e test-comment
```


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/af1f8624-5f4c-41f9-bb9f-4d0c1f3280ea/environments/bc6dbd3d-3580-451f-a22c-1e3f2f206f47/deployments/be22f7e9-6263-4f92-98c4-dd1acc1f5839)